<?php

return [

    'nav' => [
        'overview' => 'Обзор',

        'users' => "Пользователи",
        'roles' => "Роли",
        'permissions' => "Разрешения",

        'profile' => 'Профиль',
        'import' => 'Импорт',

        'headings' => [
            'management' => 'Управление',
            'settings' => 'Настройки',
        ],
    ],

    'blocks' => [
        'titles' => [
            'user_profile' => 'Профиль пользователя',
            'user_password' => 'Пароль пользователя',
            'users' => "Список пользователей",
            'user_information' => 'Информация о пользователе',
            'roles' => "Список ролей",
            'role_information' => 'Информация о роли',
            'permissions' => "Список разрешений",
            'permission_information' => 'Информация о разрешении',
            'import' => 'Импорт файлов',
        ],

        'descriptions' => [
            'user_profile' => 'Основная информация вашего аккаунта. Ваше имя пользователя будет видно всем.',
            'user_password' => 'Смена пароля для входа - простой способ защитить ваш аккаунт.',
            'user_information' => 'Информация о новом пользователе. В рамках этой информации пользователь получит доступ как администратор.',
            'role_information' => 'Информация о новой роли. В рамках этой информации пользователи будут назначены на роль.',
            'permission_information' => 'Информация о новом разрешении. Определяет всю информацию, которая имеется у разрешения.',
            'import_information' => "Импортируйте новые данные в базу данных. Эта страница обеспечивает удобный импорт.",
        ],
    ],

    'columns' => [
        'general' => [
            'id' => "ID",
            'action' => "Действие",
            'status' => "Статус",
            'created_at' => "Создано",
            'updated_at' => "Обновлено",
        ],

        'import' => [
            'section' => "Раздел",
            'file' => "Файл",
        ],

        'user' => [
            'user' => "Пользователь",
            'name' => "Имя",
            'email' => "Email",
            'password' => 'Пароль',
            'email_verified_at' => 'Email подтвержден',
            'image' => "Аватар пользователя",
            'role' => "Роль",
        ],

        'role' => [
            'role' => "Роль",
            'name' => "Название",
            'users' => "Пользователи",
            'user_count' => "Количество пользователей",
            'permissions' => "Разрешения",
            'permission_count' => "Количество разрешений",
        ],

        'permission' => [
            'permission' => "Разрешения",
            'name' => "Название",
            'guard_name' => "Имя охранника",
            'description' => "Описание",
            'is_default' => "По умолчанию",
            'roles' => "Роли",
            'role_count' => "Количество ролей",
        ],
    ],

    'placeholders' => [
        'profile' => [
            'name' => 'Введите ваше новое имя',
            'email' => 'Введите ваш новый email',
            'password' => 'Введите ваш новый пароль',
        ],

        'user' => [
            'name' => 'Введите имя пользователя',
            'email' => 'Введите email пользователя',
            'password' => 'Введите пароль пользователя',
            'role' => 'Выберите роль пользователя',
        ],

        'role' => [
            'name' => 'Введите название роли',
            'permissions' => 'Выберите разрешения',
        ]
    ],

    'buttons' => [
        'create' => 'Создать',
        'update' => 'Обновить',
        'delete' => 'Удалить',
        'restore' => 'Восстановить',
        'destroy' => 'Уничтожить',
        'back' => 'Назад',
        'close' => 'Закрыть',
        'export' => 'Экспортировать',
        'import' => 'Импортировать',
    ],

    'filters' => [
        // WITH TRASHED
        'active' => 'Активный',
        'inactive' => 'Неактивный',

        // SELECT
        'all' => 'Все',
        'choose' => "Выбрать",

        // PAGINATION
        'showing' => 'Показано',
        'from' => 'из',
        'data' => "данных",

        // INPUTS
        'search' => "Поиск",

        // DEFAULTS
        'default' => "По умолчанию",
        'not_default' => "Не по умолчанию",
    ],

    'actions' => [
        'buttons' => [
            'create' => 'Создать новый :model',
        ],

        'imports' => [
            'users' => "Импорт пользователей",
            'roles' => "Импорт ролей",
            'permissions' => "Импорт разрешений",
        ]
    ],
];
